Performance Testing/Jmeter/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
https://blazedemo.com/,100,840,686,1365,1576,2134,485,2369,0.000%,8.35701,38.82,6.09
https://blazedemo.com/reserve.php,94,691,529,1164,1333,1689,389,1857,0.000%,8.94812,64.43,7.52
Test,94,1492,1422,2210,2263,2368,933,2380,0.000%,2.23512,26.48,3.51
Thread Group:https://blazedemo.com/reserve.php,6,875,762,1089,1326,1326,616,1326,0.000%,2.22717,16.04,1.87
Thread Group:Test,6,2318,1999,2822,2985,2985,1577,2985,0.000%,.17324,2.05,0.27
Thread Group:https://blazedemo.com/purchase.php,72,700,622,1090,1214,1311,394,1438,0.000%,8.86918,58.16,7.86
Thread Group:Choose a flight,72,700,622,1090,1214,1311,394,1438,0.000%,2.47312,16.22,2.19
TOTAL,444,921,784,1671,1994,2369,389,2985,0.000%,7.25751,54.16,7.21