Performance Testing/Jmeter/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
https://blazedemo.com/,100,840,485,2369,381.36,0.000%,8.35701,38.82,6.09,4757.0
https://blazedemo.com/reserve.php,100,702,389,1857,330.97,0.000%,8.34655,60.10,7.01,7373.0
Test,100,1542,933,2985,484.33,0.000%,2.29716,27.21,3.60,12130.0
https://blazedemo.com/purchase.php,100,725,394,1457,274.67,0.000%,8.22978,53.97,7.29,6715.0
Choose a flight,100,725,394,1457,274.67,0.000%,3.01686,19.78,2.67,6715.0
TOTAL,500,907,389,2985,480.90,0.000%,7.66730,56.44,7.53,7538.0